{"format": "keras", "nodes": [{"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 163968}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["input_4", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "dense_2"], ["dense_2", "dropout_1"], ["dropout_1", "dense_3"]]}