{"format": "keras", "nodes": [{"name": "input_20", "id": "input_20", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_9", "id": "global_average_pooling2d_9", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_20", "id": "dense_20", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 163968}, {"name": "dropout_9", "id": "dropout_9", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_21", "id": "dense_21", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["input_20", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_9"], ["global_average_pooling2d_9", "dense_20"], ["dense_20", "dropout_9"], ["dropout_9", "dense_21"]]}