{"format": "keras", "nodes": [{"name": "input_23", "id": "input_23", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_10", "id": "global_average_pooling2d_10", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_20", "id": "dense_20", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 327936}, {"name": "dropout_10", "id": "dropout_10", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_21", "id": "dense_21", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_23", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_10"], ["global_average_pooling2d_10", "dense_20"], ["dense_20", "dropout_10"], ["dropout_10", "dense_21"]]}