{"format": "keras", "nodes": [{"name": "efficientnetb0_input", "id": "efficientnetb0_input", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 64], "num_parameters": 81984}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 64], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 5], "num_parameters": 325}], "edges": [["efficientnetb0_input", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d"], ["global_average_pooling2d", "dense"], ["dense", "dropout"], ["dropout", "dense_1"]]}