{"format": "keras", "nodes": [{"name": "input_10", "id": "input_10", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_4", "id": "global_average_pooling2d_4", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_8", "id": "dense_8", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_4", "id": "dropout_4", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_9", "id": "dense_9", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_10", "resnet50"], ["resnet50", "global_average_pooling2d_4"], ["global_average_pooling2d_4", "dense_8"], ["dense_8", "dropout_4"], ["dropout_4", "dense_9"]]}