{"format": "keras", "nodes": [{"name": "input_12", "id": "input_12", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_5", "id": "global_average_pooling2d_5", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_10", "id": "dense_10", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_5", "id": "dropout_5", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_11", "id": "dense_11", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_12", "resnet50"], ["resnet50", "global_average_pooling2d_5"], ["global_average_pooling2d_5", "dense_10"], ["dense_10", "dropout_5"], ["dropout_5", "dense_11"]]}