{"format": "keras", "nodes": [{"name": "input_8", "id": "input_8", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_3", "id": "global_average_pooling2d_3", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_6", "id": "dense_6", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_3", "id": "dropout_3", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_7", "id": "dense_7", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_8", "resnet50"], ["resnet50", "global_average_pooling2d_3"], ["global_average_pooling2d_3", "dense_6"], ["dense_6", "dropout_3"], ["dropout_3", "dense_7"]]}