{"format": "keras", "nodes": [{"name": "input_6", "id": "input_6", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_2", "id": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_4", "id": "dense_4", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_2", "id": "dropout_2", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_5", "id": "dense_5", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_6", "resnet50"], ["resnet50", "global_average_pooling2d_2"], ["global_average_pooling2d_2", "dense_4"], ["dense_4", "dropout_2"], ["dropout_2", "dense_5"]]}