{"format": "keras", "nodes": [{"name": "input_5", "id": "input_5", "class_name": "InputLayer", "output_shape": [[null, 299, 299, 3]], "num_parameters": 0}, {"name": "inception_v3", "id": "inception_v3", "class_name": "Functional", "output_shape": [null, 8, 8, 2048], "num_parameters": 21802784}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_5", "inception_v3"], ["inception_v3", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "dense_2"], ["dense_2", "dropout_1"], ["dropout_1", "dense_3"]]}