{"format": "keras", "nodes": [{"name": "input_16", "id": "input_16", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_7", "id": "global_average_pooling2d_7", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_15", "id": "dense_15", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_7", "id": "dropout_7", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_16", "id": "dense_16", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_16", "resnet50"], ["resnet50", "global_average_pooling2d_7"], ["global_average_pooling2d_7", "dense_15"], ["dense_15", "dropout_7"], ["dropout_7", "dense_16"]]}