{"format": "keras", "nodes": [{"name": "input_31", "id": "input_31", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "MobilenetV3large", "id": "MobilenetV3large", "class_name": "Functional", "output_shape": [null, 7, 7, 960], "num_parameters": 2996352}, {"name": "global_average_pooling2d_14", "id": "global_average_pooling2d_14", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 960], "num_parameters": 0}, {"name": "dense_28", "id": "dense_28", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 246016}, {"name": "dropout_126", "id": "dropout_126", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_29", "id": "dense_29", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_31", "MobilenetV3large"], ["MobilenetV3large", "global_average_pooling2d_14"], ["global_average_pooling2d_14", "dense_28"], ["dense_28", "dropout_126"], ["dropout_126", "dense_29"]]}