{"format": "keras", "nodes": [{"name": "input_25", "id": "input_25", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 7, 7, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d_11", "id": "global_average_pooling2d_11", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense_22", "id": "dense_22", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 459008}, {"name": "dropout_11", "id": "dropout_11", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_23", "id": "dense_23", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_25", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d_11"], ["global_average_pooling2d_11", "dense_22"], ["dense_22", "dropout_11"], ["dropout_11", "dense_23"]]}