{"format": "keras", "nodes": [{"name": "input_26", "id": "input_26", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_12", "id": "global_average_pooling2d_12", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_24", "id": "dense_24", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 163968}, {"name": "dropout_12", "id": "dropout_12", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_25", "id": "dense_25", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["input_26", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_12"], ["global_average_pooling2d_12", "dense_24"], ["dense_24", "dropout_12"], ["dropout_12", "dense_25"]]}