{"format": "keras", "nodes": [{"name": "input_32", "id": "input_32", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_15", "id": "global_average_pooling2d_15", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_30", "id": "dense_30", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "batch_normalization", "id": "batch_normalization", "class_name": "BatchNormalization", "output_shape": [null, 256], "num_parameters": 1024}, {"name": "dropout_15", "id": "dropout_15", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_31", "id": "dense_31", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_32", "resnet50"], ["resnet50", "global_average_pooling2d_15"], ["global_average_pooling2d_15", "dense_30"], ["dense_30", "batch_normalization"], ["batch_normalization", "dropout_15"], ["dropout_15", "dense_31"]]}