{"format": "keras", "nodes": [{"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_1", "id": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_4", "resnet50"], ["resnet50", "global_average_pooling2d_1"], ["global_average_pooling2d_1", "dense_2"], ["dense_2", "dropout_1"], ["dropout_1", "dense_3"]]}