{"format": "keras", "nodes": [{"name": "input_18", "id": "input_18", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_8", "id": "global_average_pooling2d_8", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_18", "id": "dense_18", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_8", "id": "dropout_8", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_19", "id": "dense_19", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_18", "resnet50"], ["resnet50", "global_average_pooling2d_8"], ["global_average_pooling2d_8", "dense_18"], ["dense_18", "dropout_8"], ["dropout_8", "dense_19"]]}