{"format": "keras", "nodes": [{"name": "input_33", "id": "input_33", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "MobilenetV3large", "id": "MobilenetV3large", "class_name": "Functional", "output_shape": [null, 7, 7, 960], "num_parameters": 2996352}, {"name": "global_average_pooling2d_15", "id": "global_average_pooling2d_15", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 960], "num_parameters": 0}, {"name": "dense_30", "id": "dense_30", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 246016}, {"name": "dropout_127", "id": "dropout_127", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_31", "id": "dense_31", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_33", "MobilenetV3large"], ["MobilenetV3large", "global_average_pooling2d_15"], ["global_average_pooling2d_15", "dense_30"], ["dense_30", "dropout_127"], ["dropout_127", "dense_31"]]}