{"format": "keras", "nodes": [{"name": "input_28", "id": "input_28", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_13", "id": "global_average_pooling2d_13", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_26", "id": "dense_26", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_13", "id": "dropout_13", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_27", "id": "dense_27", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_28", "resnet50"], ["resnet50", "global_average_pooling2d_13"], ["global_average_pooling2d_13", "dense_26"], ["dense_26", "dropout_13"], ["dropout_13", "dense_27"]]}