{"format": "keras", "nodes": [{"name": "input_24", "id": "input_24", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_11", "id": "global_average_pooling2d_11", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_22", "id": "dense_22", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 163968}, {"name": "dropout_11", "id": "dropout_11", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_23", "id": "dense_23", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["input_24", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_11"], ["global_average_pooling2d_11", "dense_22"], ["dense_22", "dropout_11"], ["dropout_11", "dense_23"]]}