{"format": "keras", "nodes": [{"name": "input_30", "id": "input_30", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "resnet50", "id": "resnet50", "class_name": "Functional", "output_shape": [null, 7, 7, 2048], "num_parameters": 23587712}, {"name": "global_average_pooling2d_14", "id": "global_average_pooling2d_14", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense_28", "id": "dense_28", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout_14", "id": "dropout_14", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_29", "id": "dense_29", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_30", "resnet50"], ["resnet50", "global_average_pooling2d_14"], ["global_average_pooling2d_14", "dense_28"], ["dense_28", "dropout_14"], ["dropout_14", "dense_29"]]}