{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 299, 299, 3]], "num_parameters": 0}, {"name": "inception_v3", "id": "inception_v3", "class_name": "Functional", "output_shape": [null, 8, 8, 2048], "num_parameters": 21802784}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 2048], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 524544}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_2", "inception_v3"], ["inception_v3", "global_average_pooling2d"], ["global_average_pooling2d", "dense"], ["dense", "dropout"], ["dropout", "dense_1"]]}