{"format": "keras", "nodes": [{"name": "input_8", "id": "input_8", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "efficientnetb0", "id": "efficientnetb0", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 4049571}, {"name": "global_average_pooling2d_3", "id": "global_average_pooling2d_3", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_6", "id": "dense_6", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 163968}, {"name": "dropout_3", "id": "dropout_3", "class_name": "Dropout", "output_shape": [null, 128], "num_parameters": 0}, {"name": "dense_7", "id": "dense_7", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 774}], "edges": [["input_8", "efficientnetb0"], ["efficientnetb0", "global_average_pooling2d_3"], ["global_average_pooling2d_3", "dense_6"], ["dense_6", "dropout_3"], ["dropout_3", "dense_7"]]}