{"format": "keras", "nodes": [{"name": "input_29", "id": "input_29", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "MobilenetV3large", "id": "MobilenetV3large", "class_name": "Functional", "output_shape": [null, 7, 7, 960], "num_parameters": 2996352}, {"name": "global_average_pooling2d_13", "id": "global_average_pooling2d_13", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 960], "num_parameters": 0}, {"name": "batch_normalization_5", "id": "batch_normalization_5", "class_name": "BatchNormalization", "output_shape": [null, 960], "num_parameters": 3840}, {"name": "dropout_124", "id": "dropout_124", "class_name": "Dropout", "output_shape": [null, 960], "num_parameters": 0}, {"name": "dense_26", "id": "dense_26", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 246016}, {"name": "dropout_125", "id": "dropout_125", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_27", "id": "dense_27", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_29", "MobilenetV3large"], ["MobilenetV3large", "global_average_pooling2d_13"], ["global_average_pooling2d_13", "batch_normalization_5"], ["batch_normalization_5", "dropout_124"], ["dropout_124", "dense_26"], ["dense_26", "dropout_125"], ["dropout_125", "dense_27"]]}