{"format": "keras", "nodes": [{"name": "input_27", "id": "input_27", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 3]], "num_parameters": 0}, {"name": "mobilenetv2_1.00_224", "id": "mobilenetv2_1.00_224", "class_name": "Functional", "output_shape": [null, 7, 7, 1280], "num_parameters": 2257984}, {"name": "global_average_pooling2d_12", "id": "global_average_pooling2d_12", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1280], "num_parameters": 0}, {"name": "dense_24", "id": "dense_24", "class_name": "Dense", "output_shape": [null, 256], "num_parameters": 327936}, {"name": "dropout_123", "id": "dropout_123", "class_name": "Dropout", "output_shape": [null, 256], "num_parameters": 0}, {"name": "dense_25", "id": "dense_25", "class_name": "Dense", "output_shape": [null, 6], "num_parameters": 1542}], "edges": [["input_27", "mobilenetv2_1.00_224"], ["mobilenetv2_1.00_224", "global_average_pooling2d_12"], ["global_average_pooling2d_12", "dense_24"], ["dense_24", "dropout_123"], ["dropout_123", "dense_25"]]}